## Terraform Plan Summary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.dev_log_data will be created
  + resource "google_storage_bucket" "dev_log_data" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "dev-log-data"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.first_dev_bucket_demo will be created
  + resource "google_storage_bucket" "first_dev_bucket_demo" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "first-dev-bucket-demo"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.labweek_demo1 will be created
  + resource "google_storage_bucket" "labweek_demo1" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "labweek-demo1"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.labweek_demo2 will be created
  + resource "google_storage_bucket" "labweek_demo2" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "labweek-demo2"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.labweek_demo3 will be created
  + resource "google_storage_bucket" "labweek_demo3" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "labweek-demo3"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.labweek_demo7 will be created
  + resource "google_storage_bucket" "labweek_demo7" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "labweek-demo7"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.labweek_demo8 will be created
  + resource "google_storage_bucket" "labweek_demo8" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "labweek-demo8"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_app_12_gc_test will be created
  + resource "google_storage_bucket" "my_app_12_gc_test" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-app-12-gc-test"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_app_221_sys_test will be created
  + resource "google_storage_bucket" "my_app_221_sys_test" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-app-221-sys-test"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_app_engine_sys_2312 will be created
  + resource "google_storage_bucket" "my_app_engine_sys_2312" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-app-engine-sys-2312"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_app_sys_test_1526 will be created
  + resource "google_storage_bucket" "my_app_sys_test_1526" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-app-sys-test-1526"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_auth_123_sys_abc will be created
  + resource "google_storage_bucket" "my_auth_123_sys_abc" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-auth-123-sys-abc"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_bket_sys_1435 will be created
  + resource "google_storage_bucket" "my_bket_sys_1435" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-bket-sys-1435"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_demo_bucket_786 will be created
  + resource "google_storage_bucket" "my_demo_bucket_786" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-demo-bucket-786"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_sys_app_test_1231 will be created
  + resource "google_storage_bucket" "my_sys_app_test_1231" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-sys-app-test-1231"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.my_system_bucket_122341 will be created
  + resource "google_storage_bucket" "my_system_bucket_122341" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "my-system-bucket-122341"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.sa_ashas_12_asa will be created
  + resource "google_storage_bucket" "sa_ashas_12_asa" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "sa-ashas-12-asa"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.sys_ap_1232_32321 will be created
  + resource "google_storage_bucket" "sys_ap_1232_32321" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "sys-ap-1232-32321"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.sys_app_1232_gcn will be created
  + resource "google_storage_bucket" "sys_app_1232_gcn" {
      + effective_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "env"   = "dev"
          + "owner" = "selfservice"
        }
      + location                    = "ASIA-SOUTH1"
      + name                        = "sys-app-1232-gcn"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "env"                        = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "selfservice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.
